app/Controllers/AdminController.php

SELECT *
FROM `type_operation`
---
    public function dashboard()
    {
        if ($redirect = $this->checkAuth()) return $redirect;

        $prefixeModel = new PrefixeOperateurModel();
        $typeModel    = new TypeOperationModel();
        $gainsModel   = new GainsModel();
        $comptesModel = new ComptesModel();

        return view('admin_dashboard', [
            'prefixes' => $prefixeModel->getAll(),
            'types'    => $typeModel->findAll(),

SELECT *
FROM `prefixe_operateur`
WHERE `prefixe_operateur`.`id` = '2'
---
    public function togglePrefixe($id)
    {
        if ($redirect = $this->checkAuth()) return $redirect;

        $prefixeModel = new PrefixeOperateurModel();
        $prefixe = $prefixeModel->find($id);