app/Controllers/ConnexionController.php

    public function home()
    {
        if (!session()->has('client_id')) {
            return redirect()->to('/');
        }

        $clientModel = new ClientModel();
        $operationModel = new OperationModel();

        $client = $clientModel->find(session()->get('client_id'));
---
SELECT *
FROM `client`
WHERE `client`.`id` = 1

    public function retrait()
    {
        $montant = (float) $this->request->getPost('montant');
        $clientModel = new ClientModel();
        $operationModel = new OperationModel();

        $client = $clientModel->find(session()->get('client_id'));

        if ($client['solde'] >= $montant) {
            $soldeAvant = $client['solde'];
            $soldeApres = $soldeAvant - $montant;

            $clientModel->update($client['id'], ['solde' => $soldeApres]);

            $operationModel->insert([
                'type_operation_id' => 2,
                'client_id'         => $client['id'],
                'montant'           => $montant,
                'frais_applique'    => 0,
                'montant_total'     => $montant,
                'solde_avant'       => $soldeAvant,
                'solde_apres'       => $soldeApres,
                'statut'            => 'reussie'
            ]);
---
SELECT *
FROM `client`
WHERE `client`.`id` = 1
UPDATE `client` SET `solde` = 45000
WHERE `client`.`id` IN (1)
INSERT INTO `operation` (`type_operation_id`, `client_id`, `montant`, `frais_applique`, `montant_total`, `solde_avant`, `solde_apres`, `statut`) VALUES (2, 1, 20000, 0, 20000, 40000, 20000, 'reussie')