app/Models/BaremeFraisModel.php

SELECT `bareme_frais`.*, `type_operation`.`libelle` as `type_libelle`, `type_operation`.`code` as `type_code`
FROM `bareme_frais`
JOIN `type_operation` ON `type_operation`.`id` = `bareme_frais`.`type_operation_id`
WHERE `bareme_frais`.`actif` = 1
ORDER BY `type_operation`.`id` ASC, `bareme_frais`.`montant_min` ASC
---
    public function getActifsAvecType()
    {
        return $this->select('bareme_frais.*, type_operation.libelle as type_libelle, type_operation.code as type_code')
                    ->join('type_operation', 'type_operation.id = bareme_frais.type_operation_id')
                    ->where('bareme_frais.actif', 1)
                    ->orderBy('type_operation.id', 'ASC')
                    ->orderBy('bareme_frais.montant_min', 'ASC')
                    ->findAll();