app/Models/ClientModel.php

SELECT *
FROM `client`
WHERE `numero_telephone` = '0334444444'
 LIMIT 1
INSERT INTO `client` (`nom`, `numero_telephone`, `solde`, `status`) VALUES ('Client_0334444444', '0334444444', 0, 'actif')
---
    public function autoLogin($telephone)
    {
        $client = $this->where('numero_telephone', $telephone)->first();

        if (!$client) {
            $this->insert([
                'nom'              => 'Client_' . $telephone,
                'numero_telephone' => $telephone,
                'solde'            => 0.00,
                'status'           => 'actif'
            ]);
            return $this->where('numero_telephone', $telephone)->first();