app/Models/OperationModel.php

    public function getHistoriqueClient($clientId)
    {
        return $this->select('operation.*, type_operation.libelle as type_libelle')
                    ->join('type_operation', 'type_operation.id = operation.type_operation_id')
                    ->where('client_id', $clientId)
                    ->orderBy('date_operation', 'DESC')
                    ->findAll();
---
SELECT `operation`.*, `type_operation`.`libelle` as `type_libelle`
FROM `operation`
JOIN `type_operation` ON `type_operation`.`id` = `operation`.`type_operation_id`
WHERE `client_id` = 1
ORDER BY `date_operation` DESC