app/Models/PrefixeOperateurModel.php

    public function getAll()
    {
        return $this->orderBy('prefixe', 'ASC')->findAll();
---
SELECT *
FROM `prefixe_operateur`
ORDER BY `prefixe` ASC

    public function toggleActif($id, $actif)
    {
        return $this->update($id, ['actif' => $actif]);
---
UPDATE `prefixe_operateur` SET `actif` = 1
WHERE `prefixe_operateur`.`id` IN ('2')